{
  "tips": [
    { "text": "You can hold down right-click on X-Spline handles to smooth the whole spline at once." },
    { "text": "Increase Zoom% or Angle in the track tab for tracks with large amounts of zoom/rotation to increase the accuracy of the track." },
    { "text": "If your shape is about to go off screen, but you have more plane you can track, add another shape with the 'Add to Spline' tool." },
    { "text": "Always scrub your timeline a few times to see where your objects are going to end up! There may be a better way start the track." },
    { "text": "Don't use one shape for complex roto! It is better to break your work down into smaller shapes than deal with a single spline." },
    { "text": "The remove tool in Mocha Pro needs at least 2 layers: A foreground mask for the object you want to remove, and a tracked background shape.", "products": [ "mochapro" ] },
    { "text": "Check that your frame rate and aspect ratio match between Mocha and your other software! Tracks may drift if they are different." },
    { "text": "If you have to add extra frames to the start of your shot, go to the dope sheet to select all your keys and move them forward." },
    { "text": "Take a break now and then. You only have one pair of eyes. Well, at least until they work out decent cybernetic implants." },
    { "text": "Adjust the amount of lines in the grid by using the Viewer Preferences panel in the top right corner. Also, use the grid!" },
    { "text": "Don't be afraid to start again. Sometimes a fresh layer is much more efficient than continually tweaking a problem one." },
    { "text": "Rather than track and roto with the same shape, it can be better to track a shape, then link a refined roto to the tracked layer." },
    { "text": "Pan (X) and Zoom (Z) are your friends when doing roto. You can get in close and move around without having to close the shape." },
    { "text": "If your layer is not moving when you paste transform data into After Effects, you may need to remove the Anchor Point keys." },
    { "text": "You can adjust the surface at any time and it will still move relative to the tracking data, except when using manual mode." },
    { "text": "Moving the spline does not move the tracking! The spline is only a search area, not the tracked data." },
    { "text": "View your surface and/or grid while tracking. It helps to see how the track is going more accurately than the spline shape." },
    { "text": "Use the join layers tool to track two non-co-planar planes right next to one another without any overlap." },
    { "text": "Pan/Tilt/Zoom camera solves may only require one planar track, Parallax shots require two or more different planes.", "products": [ "mochapro" ] },
    { "text": "When you roto in Mocha, split up people &#8220;paper doll&#8221; style along their joints. You’ll dramatically speed up workflow." },
    { "text": "Get some sleep. After too many hours on one project you can make expensive mistakes." },
    { "text": "Layers at the top of the layer pile are automatically held out of layers below them when tracking OR rendering in Mocha." },
    { "text": "Don’t be afraid of blur, all Mocha needs to hang on to a plane is texture. Track from high detail to low." },
    { "text": "If the object you are tracking is zooming, track from the largest part to the smallest part." },
    { "text": "The remove tool can replace any object that you can see completely behind over time, otherwise you need to invent a background by painting a clean plate.", "products": [ "mochapro" ] },
    { "text": "Trying to add head frames to a shot already tracked? Use the dopesheet to slide your keyframes." }, 
    { "text": "We have tons of free training on Mocha’s website, check for more at <a href=\"https://borisfx.com\">borisfx.com</a>." },
    { "text": "When tracking in Mocha, don’t look for small areas of high contrast detail, look for large areas of texture." },
    { "text": "Mocha uses X-Splines or Bezier Splines for roto, depending on your preference." },
    { "text": "Use the Insert tool in Mocha Pro to warp and motion blur any insert before you comp.", "products": [ "mochapro" ] },
    { "text": "Having trouble? Stuck? Best to log a support case with us and someone from our team will be happy to help at <a href=\"https://borisfx.com/support\">borisfx.com</a>.", "products": [ "mochapro" ] },
    { "text": "You can change tracking parameters in the middle of a track; if the track is slipping because of skew, turn it off and on later." },
    { "text": "Get creative! Sometimes you can use another object in the scene to track an object that is being obscured or going offscreen." },
    { "text": "Always watch for barely there, but consistently moving reflections or shadows; Mocha will notice them even if you don’t!" },
    { "text": "Remove module render times can be cut down by adjusting step and frames before/after.", "products": [ "mochapro" ] },
    { "text": "You can turn off the splines to just view the matte and control points, so you have no lines in the way when you are doing roto." },
    { "text": "Every shot is different; if you used a particular method on 1 shot it doesn't mean you don't have to think creatively on the next" },
    { "text": "Larger remove areas require more processing power than smaller ones, and so does illumination modeling... use what you need.", "products": [ "mochapro" ] },
    { "text": "Do you have ideas for improving features? Submit a feature request with support at <a href=\"https://borisfx.com/support\">borisfx.com</a>." },
    { "text": "Having trouble tracking areas for roto? Try just tracking translation and using that as your roto guide layer." },
    { "text": "You can render the lens warp as an STMap and use that in Nuke or Fusion, or use the Mocha Plug-in to warp and unwarp lens renders.", "products": [ "mochapro" ] },
    { "text": "When tracking people, pretend they are low-polygon models like in video games; track planes one at a time, or use PowerMesh." },
    { "text": "If you're having trouble understanding a process in Mocha, take some time out to watch our tutorials." },
    { "text": "Check out our Tip videos at <a href=\"https://borisfx.com/videos/?tags=product:Mocha%20Pro&search=\">borisfx.com</a>." },
    { "text": "You can often trick the planar tracker into thinking things are planar. Not everything has to be a brick wall or a sign." },
    { "text": "Use extra layers above your remove layer to mask foreground items you don’t want to remove. Remember to turn their cogs off!", "products": [ "mochapro" ] },
    { "text": "Set your 'Min % Pixels Used' to a higher value if you are not getting a good track. Sometimes Mocha needs more information." },
    { "text": "Don’t forget to save. You can change the autosave interval in the System tab under Preferences." },
    { "text": "Only track what you need. Tracking with just Rotation, Scale and Translation may give better results if that is all you require." },
    { "text": "You can hold down right-click on X-Spline handles to smooth the whole spline at once." },
    { "text": "Launch Mocha Pro as the default from After Effects by checking Mocha Pro preferences > Launch in AE. In AE, go to animation>Track in Boris FX Mocha" },
    { "text": "Increase Zoom% or Angle in the track tab for tracks with large amounts of zoom/rotation to increase the accuracy of the track." },
    { "text": "Every module in Mocha Pro is only as good as the track you have created to drive it. Make sure your tracks are solid!", "products": [ "mochapro" ] },
    { "text": "When you use AdjustTrack, you may have to get creative with reference points. Find refs you can see throughout the shot." },
    { "text": "Modules in Mocha work from left to right, so check your clip settings first, your lens solve second, then track, then adjust." },
    { "text": "Having trouble tracking a highly compressed shot? Try only tracking the edges of a plane and cut out flat areas of one color." },
    { "text": "Can't tell if a track is drifting or not? Turn the checkerboard grids on in the insert drop-down in layer properties." },
    { "text": "Uncheck splines under the &#8220;Show spline tangents&#8221; button and turn on Mattes to tweak a shape with only points showing and no lines." },
    { "text": "To use shapes in After Effects, you can view them as a Matte in the Plug-in effect or generate AE splines via pasting or using &#8220;Create AE masks&#8221; the Plug-in interface" },
    { "text": "Optimize your removes by adjusting the &#8220;Frames Before&#8221; and &#8220;Frames After&#8221; fields. You may not need to look at ALL the frames.", "products": [ "mochapro" ] },
    { "text": "Hold down the Cmd/Ctrl key when using the Transform Tool in Mocha to distort and skew splines." },
    { "text": "Use the &#220;berkey to adjust all your keys at once, but remember to turn it off!" },
    { "text": "Large files? Import a smaller res file to track and roto, then relink the larger file before export. Or just use our proxy scale." },
    { "text": "Get a drawing tablet if you’re doing lots of work in paint or roto. Drawing with a mouse is inefficient and hard on your wrist." },
    { "text": "Press Alt/Option and one of the number keys to hide different overlays in Mocha. The backdash hides everything except mattes." },
    { "text": "Press the asterisk (*) key to zoom to 100%. Alternatively, hold the Z key and click once on the viewer." },
    { "text": "When trying to track 'crunchy' hyper-color-corrected footage, you may want to try switching from luminance to auto channel." },
    { "text": "We are always looking for new footage for webinars and demos; if you have a tough shot, send it to us at <a href=\"https://borisfx.com/support\">borisfx.com</a>." },
    { "text": "If you need to contact support, the more information you can give about your Mocha situation the better. Help us to help you.", "products": [ "mochapro" ] },
    { "text": "'Small motion' tracks mean miniscule motion tracking, think of wind slightly shaking a camera tripod to get an idea of how small." },
    { "text": "Import your own matte clips from other applications in the layer Matte Clip drop down to help mask your tracks or removes." },
    { "text": "Use the in and out fields in the Layer Properties to hide and disable layers you no longer need after a certain frame." },
    { "text": "Make layouts! In the View menu you can customize multiple layouts. Select one and start adding and removing GUI to taste, then name it!" },
    { "text": "Check that Mocha is not in LE mode before working! Mocha will save in a learning edition format if the license has dropped.", "products": [ "mochapro" ] },
    { "text": "Layers go from foreground (top) to background (bottom). Remember to order them right when tracking or your mask might not mask!" },
    { "text": "Share your knowledge! If you’ve discovered a cool trick inside Mocha, create a tutorial and show it off to the world." },
    { "text": "Tracking a hard shot and don't have enough data? Add shapes to similarly moving planes." },
    { "text": "Keep an eye on your track just in case there are hidden surprises! You may return to find an unexpected motion." },
    { "text": "Name your layers. It’s an effective reminder for you and a delight for everybody you work with." },
    { "text": "Keep a little of the background in your shapes when tracking most objects. This helps for Mocha to see how the plane is moving." },
    { "text": "Sometimes there are things that don’t LOOK like they can be tracked, but you can be pleasantly surprised. When in doubt, try!" },
    { "text": "Draw! Sketching regularly is a good way to keep your observation and hand/eye skills top notch for roto, tracking and paint jobs." },
    { "text": "Watch ALL the videos! Many tutorials cover tips for both Mocha Pro and Mocha AE, even if only one product is being used." },
    { "text": "A face is just a series of planes. Track each plane separately for better results." },
    { "text": "Having trouble with an interlaced shot? Try deinterlacing it before loading it into Mocha. You can add interlacing back in." },
    { "text": "If you're tracking a super grainy shot, give Mocha as much planar data as you can. The bigger the shape, the better the track." },
    { "text": "If you can't figure out what planes to track, ask a friend, fresh eyes can help when you've been looking at a shot too long." },
    { "text": "We recommend compositing remove renders back into the original plate and matching grain to the original shot for best results.", "products": [ "mochapro" ] },
    { "text": "You can use Mocha roto shapes for anything from traditional roto to driving effects and plugins, and isolating color corrections." },
    { "text": "You don't have to render the entire shot inside Mocha when using the Plug-In! Everything is rendered again in the host.", "products": [ "mochapro" ] },
    { "text": "Hold down Cmd/Ctrl + Shift while moving points or surface corners to refine or 'slow down' the movement for accurate positioning." },
    { "text": "Move you Mocha project to other hosts and projects by using 'Export Project' from the file menu. You can then open or merge to another project.", "products": [ "mochapro" ] },
    { "text": "If an erratic or fast-moving shot is giving your trouble, try increasing the search area." },
    { "text": "Want to tweak something to work your way? Why not try scripting your own tool with our Python API.", "products": [ "mochapro" ] },
    { "text": "You can also export renders directly out of the Mocha Plug-in via the File menu rather than render it in the host.", "products": [ "mochapro" ] },
    { "text": "Scrub the timeline first to get an idea of the shot before tracking. It saves you a lot of time later." },
    { "text": "You can change the timing of each autosave and amount of incremental backups in Preferences." },
    { "text": "Where possible, make a clean plate for Remove renders. It speeds up rendering when they are used exclusively.", "products": [ "mochapro" ] },
    { "text": "If you need to wipe your machine, remember to deactivate your Mocha license first!", "products": [ "mochapro" ] },
    { "text": "You can customize OCIO color settings in Project Settings and Preferences" },
    { "text": "When did you last back up your work? Use this as a reminder to do it now!" },
    { "text": "What time is it? It's Mocha time! That's not a valid unit of measurement but we hope you enjoy tracking." },
    { "text": "It is pronounced \\ˈm&#333;-k&#601;\\, regardless of how you may order your coffee of the same name." },
    { "text": "Have a nice stretch before continuing. Mocha's great but it can't help with back pain." },
    { "text": "Have you had a desk break today? Go for a walk before diving back into work." },
    { "text": "Be nice to your computer. It's doing its best." },
    { "text": "Welcome back to Mocha! We hope you are having a nice day even with all this nonsense going on." },
    { "text": "We hope you're doing okay and Mocha is helping you get some exciting work done." },
    { "text": "If you say Mocha 3 times in a mirror nothing happens and everything’s fine." }
  ]
}
